app/controllers/comments_controller.rb

    def create
    @request = Request.find(params[:request_id])
    @comment = @request.comments.create!(comment_params)
---
SELECT  "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "request_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", ""], ["request_id", 1], ["created_at", "2018-05-28 03:16:27.392699"], ["updated_at", "2018-05-28 03:16:27.392699"]]