app/controllers/requests_controller.rb

INSERT INTO "requests" ("partnum", "explanation", "conditions", "modelsavailable", "mass", "iterative", "kpitinfo", "linkinfo", "testmethod", "assigneduser", "esttime", "estcost", "reportlink", "reqdate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @request = Request.new(request_params)

    respond_to do |format|
      if @request.save

UPDATE "requests" SET "kpitinfo" = ?, "linkinfo" = ?, "testmethod" = ?, "assigneduser" = ?, "esttime" = ?, "estcost" = ?, "updated_at" = ? WHERE "requests"."id" = ?
---
  def update
    respond_to do |format|
      if @request.update(request_params)